! Title: Xpi uBo Personal Filters
! Expires: 6 days
! Last modified: Tue, 30 Dec 2025 13:35:00 -0800 GMT
! License: https://github.com/troysjanda/MyBlockLists/blob/master/LICENSE
! -- Start Filters --
*$object,redirect-rule=empty,domain=sonixgvn.net
*/cleardot.gif$image,redirect=1x1-transparent.gif
*/cleardot.gif$xmlhttprequest,redirect=1x1-transparent.gif
*/wp-content/plugins/adtoniq/^$important,third-party
/advert.js$important
/analytics.js
/i.gif
/p.gif
/pixel*.gif^
/sp.js
/static/pixel.png
/wp-admin/admin-ajax.php
/wp-content/plugins/wp-content-copy-protector^
2mdn.net^$important
9b.news##.auto-style122
9b.news##tr:nth-of-type(13) > .auto-style79
9b.news##tr:nth-of-type(14)
9b.news##tr:nth-of-type(15)
9b.news##tr:nth-of-type(16)
9b.news##tr:nth-of-type(17)
9b.news##tr:nth-of-type(18)
9b.news##tr:nth-of-type(21) > .auto-style101
@@*$stylesheet
@@||disqus.com/embed.js?_=1457540*$script
@@||gstatic.com/cv/js/sender/v1/cast_sender.js$script,domain=cbs.com
@@||imagesvc.meredithcorp.io^$image,domain=allrecipes.com
@@||newegg.com/amber3/$badfilter
@@||outbrain.com^$script,domain=dailywire.com
@@||pandora.com/web-version/*/ads.json$xhr
@@||s0.2mdn.net/instream/html5/ima3.js$script,domain=cbs.com
@@||techisignals.com^$generichide
@@||www.askdavetaylor.com/detroitchicago/*$script,domain=www.askdavetaylor.com
@@||www.broadwayworld.com/detroitchicago/*$script,domain=www.broadwayworld.com
adtoniq.com^$important,third-party
amazon.*##*:focus:style(outline: none !important;)
amazon.com##[data-component-type="sp-sponsored-result"]
amazon.com,amazon.in##.a-expander-header:style(display:none !important;)
amazon.com,amazon.in##[data-a-expander-name="review_text_read_more"]:style(height:300px !important;)
animexin.vip##+js(no-xhr-if, googlesyndication.com)
anitube.*##+js(abort-on-property-read, redirect1)
armourgaming.co###tidio-chat-iframe
armourgaming.co##.notifyjs-container
armourgaming.co##.np-inside
artribune.com##+js(acs, dataLayer, AdBlockCounter)
askvg.com##.ad-unit
audiotruyenfull.com##+js(no-fetch-if, googlesyndication)
autonews.com##+js(nostif, t.stackTrace)
autonews.com##body,html:style(overflow:auto !important)
b.thumbs.redditmedia.com/aNhI3KImJD96qOVUxkb9q6iw8stNuD0v_2WYCUoXS4I.png
bartarinha.ir##div[class*="position-"]
betanews.com###bd > .sideCol > .submitNews.content
betanews.com###bd > .sideCol > div.flexibleBoxad > .adbox-header
betanews.com##.articleBoxad
betanews.com##.authorThumb[src="\/wp-content\/themes\/betanews\/images\/authors\/Sofia_smallthumb\.png"]
betanews.com##.clearfix.articleBreak
betanews.com##.clearfix.body > ul
betanews.com##.clearfix.content > .halfCol
betanews.com##.editorial.section
betanews.com##.follow
betanews.com##.header > h2
betanews.com##.twitter-share-button-error.twitter-share-button
betanews.com##[id^="post-"]:if(.author:has-text(/(Sofia Elizabella Wyciślik-Wilson)/i))
betanews.com##[src="https://betanews.com/wp-content/themes/betanews/images/authors/Sofia_bigthumb.png"]
betanews.com##p:nth-of-type(3)
bing.com##+js(ra, target, #b_results a[href][target="_blank"])
binged.*##+js(nowoif)
blockadblock.com##+js(nobab)
charlesmknox.com##.adsbycontextcue > iframe
clutchpoints.com##^script:has-text(Waiting 50 ms):has-text(/adthrive-ad/)
cricketarchive.com##+js(set, Pigeon.paywall, noopFunc)
deadline.com##.a-wrapper.pmc-u-padding-a-1.u-box-shadow-medium.pmc-u-background-white.pmc-u-margin-b-0
distrowatch.com##h2
distrowatch.com##td:nth-of-type(3) > table.News:nth-of-type(1)
dlford.io###ir_wrapper
dlford.io##.gGRGAW.footer__Styled-wff6aj-0
dlford.io##.railAd
dlford.io##[href^="https://sifmail.com/"]
drake-scans.com##+js(no-xhr-if, googlesyndication.com)
duckduckgo.com##.RPL9esU9f8nMDBntEfZQ
duckduckgo.com##.is-slotted-first.grid-3-cols.has-grid.has-hidden-vertical.bing.has-main-source.js-module--products.module--carousel-products.module--carousel.module
duckduckgo.com#@#div>a:has-text(/AI/):upward(div):style(opacity:0!important)
egy.best##+js(abort-current-inline-script, WinMsgHtml, adblock_msg)
egy.best##+js(abort-on-property-write, decodeURIComponent)
en.wikipedia.org###frb-main
en.wikipedia.org##.frb-button.frb-nag-link
en.wikipedia.org##.frb-country-US.frb-rml-disabled.frb
en.wikipedia.org##.frb-country-US.frb-rml-enabled.frb
en.wikipedia.org##.frb-inline-row
en.wikipedia.org##.frb-rml-enabled.frb-nag.frb
enotes.com#$#div.redacted{ color: black !important; text-shadow: unset !important; -webkit-filter: unset !important; filter: unset !important; }
everydayhealth.com##^script:has-text(/i10C/i)
facebook.com##div.h_r03bd44ox.pagelet
faucethero.com##+js(acis, blockAdBlock)
fitgirl-repacks.site###content-sidebar
fitgirl-repacks.site###footer-sidebar
forums.theregister.com###adtoniq-msgr-bar
foxnews.com##.ad-container
foxnews.com##.content:has-text(/SPONSORED/i)
foxnews.com##.dark.three-items.river.collection-topic.collection
foxnews.com##.is-programming.alert-banner
foxnews.com##.item-nation-video-overlay
gearspace.com###adwus
gearspace.com###collapseobj_latestDeals
gearspace.com###site-notice-container
gearspace.com##.sfs-srdx.sfs-desktop.subforum-sponsor
getcomics.info###advanced_floating_content_85155
ghacks.net##.row.nocol.xs-all-12-centered:has-text(/Aytun Çelebi/i)
ghacks.net##.row.nocol.xs-all-12-centered:has-text(/Carol van Zyl/i)
ghacks.net##.row.nocol.xs-all-12-centered:has-text(/Emre Ç?tak/i)
ghacks.net##.row.nocol.xs-all-12-centered:has-text(/Emre/i)
ghacks.net##.row.nocol.xs-all-12-centered:has-text(/Eray Eliaçik/i)
ghacks.net##.row.nocol.xs-all-12-centered:has-text(/Helena Bosnjak/i)
ghacks.net##.row.nocol.xs-all-12-centered:has-text(/Jesus/i)
ghacks.net##.row.nocol.xs-all-12-centered:has-text(/Kerem Gülen/i)
ghacks.net##.row.nocol.xs-all-12-centered:has-text(/Leri Koen/i)
ghacks.net##.row.nocol.xs-all-12-centered:has-text(/Onur Demirkol/i)
ghacks.net##.row.nocol.xs-all-12-centered:has-text(/Priyanka Monteiro/i)
ghacks.net##.row.nocol.xs-all-12-centered:has-text(/Richard Flower/i)
ghacks.net##.row.nocol.xs-all-12-centered:has-text(/Russell Kidson/i)
ghacks.net##.row.nocol.xs-all-12-centered:has-text(/Shaun/i)
ghacks.net##.row.nocol.xs-all-12-centered:has-text(/Trevor Monteiro/i)
ghacks.net##.row.nocol.xs-all-12-centered:has-text(/Zakhi Mgutshini/i)
ghacks.net##^iframe
ghacks.net##^script:has-text(/AdBlockerDetector/i)
gitflic.ru##.sidebar__banner
github.com##.copilotPreview__container
godaddy.com##html:style(background-image:none !important; background: none transparent !important;)
google.co.il,google.com##input[name="q"]:style(direction:ltr !important;  text-align:left !important;  letter-spacing:-.3pt !important;)
idfg.idaho.gov##.row.alert-warning.alert
ign.com##^script:has-text(g01.ign.com)
imdb.com###content-2-wide:not([class]) #sidebar > div:not(.list-activity-widget)
imdb.com###rvi-div > .recently-viewed
imdb.com##.ehSCie
imdb.com##.gbsbQW
imdb.com##.ipc-metadata-list li[data-testid="title-details-companycredits"]
imdb.com##.ipc-page-content-container--full > .ipc-page-content-container--center > div.ipc-page-grid:has(div#featured-today, iframe, section.more-to-watch, div#imdb-originals, #editors-picks, #born-today, #top-news)
imdb.com##.ipc-page-content-container--full > .ipc-page-content-container--center > div.ipc-page-grid:not(.page-grid)
imdb.com##.ipc-page-content-container--full > .ipc-page-content-container--center > div:has(#in-theaters, #top-box-office, #coming-soon-movie)
imdb.com##.ipc-page-content-container--full > .ipc-page-content-container--center div[data-testid="whatToWatch_title"]
imdb.com##.ipc-page-grid.ipc-page-grid--bias-left:has(.jFAAHq)
imdb.com##.navlinkcat__listContainerInner > ul > a:has-text(/India Movie Spotlight|Movie News|Showtimes & Tickets|on TV & Streaming|TV News/i)
imdb.com##.results-section-exact-match-btn
imdb.com##.sc-a2dd587f-0.cXRfLx
imdb.com##div.lister-item-content > div.wtw-option-standalone
imdb.com##div.lister-item-content > p:has(a[href*="https://www.imdb.com/name/"])
imdb.com##div.navlinkcat:has(input[data-category-id="video"], #nav-link-categories-awards, #nav-link-categories-celebs, #nav-link-categories-comm)
imdb.com##div:has( > label[aria-label="Toggle language selector"])
imdb.com##div:has( > section[data-testid="more-results-section"], > section[data-testid="advanced-search-section"])
imdb.com##div[data-testid="hero-subnav-bar-left-block"]
imdb.com##div[data-testid="hero-subnav-bar-right-block"]
imdb.com##footer.imdb-footer
imdb.com##li:has(#ProUpsellLink)
imdb.com##nav#imdbHeader .navbar__imdbpro
imdb.com##section > div[data-testid="episodes-header"]
imdb.com##section > div[data-testid="episodes-header"] + div > div:not([data-testid="episodes-browse-episodes"])
imdb.com##section.right-rail-more-to-explore
imdb.com##section:has( > div > div[data-testid="top-picks--title"])
imdb.com##section[cel_widget_id="StaticFeature_Awards"]
imdb.com##section[cel_widget_id="StaticFeature_FAQ"]
imdb.com##section[data-testid="BoxOffice"]
imdb.com##section[data-testid="DidYouKnow"]
imdb.com##section[data-testid="MoreLikeThis"] div:has( > a[aria-label="More information"])
imdb.com##section[data-testid="News"]
imdb.com##section[data-testid="Storyline"]
imdb.com##section[data-testid="UserReviews"]
imdb.com##section[data-testid="chart-layout-sidebar"] > div[class]
imdb.com##section[data-testid="chart-layout-sidebar"] > div[data-testid]
imdb.com##section[data-testid="contribution"]
imdb.com##section[data-testid="title-cast"] > ul
imdb.com##section[data-testid="videos-section"]
imdb.com##ul[data-testid="reviewContent-all-reviews"]
infinityscans.net##+js(nowoif)
insider-gaming.com##+js(rmnt, script, adblocker)
instagram.com###fb-root + div[role=presentation]
jayisgames.com##.widget-topad:style(padding-bottom: 20px !important;)
m.imdb.com##.bkRdrN
m.imdb.com##.iCWOBC
m.imdb.com##a[aria-label="Use app"]
m.imdb.com##a[href*="https://pro.imdb"]
m.imdb.com##label[aria-label="language-select"]
magicalthirteen.com^$important
mail.google.com##header div[jscontroller]:has(button[aria-label~="Gemini"])
megaup.net##[id^="AdskeeperComposite"]:style(opacity: 0!important;pointer-events:none!important;)
megaup.net#@#[id^="AdskeeperComposite"]:style(padding-top:1100px!important;)
msfn.org##.focus-social--iconOnly.focus-social
mvlempyr.com##.ChapterContentWrapper > :has(img[src*="disable"])
nexusmods.com##.areplacer
noscript.net##style:has-text(data:image):remove()
noypigeeks.com##a[target="_blank"] > img[src*=".noypigeeks.com/"]
nxbrew.com##+js(noeval-if, /chp_?ad/)
nytimes.com###slideup-paywall, #darken-overlay
nytimes.com##.noscroll:style(overflow: initial !important; height: initial !important; width: initial !important; position: initial !important;)
nytimes.com##div[aria-labelledby="editorial-sub-messaging-header"]
nytimes.com##form[name="newsletter-banner"]:upward([aria-hidden])
ownedcore.com/forums/ocpbanners^
pandora.com##script:contains(getAdList)
pastehouse.com##.text-center.m-2.col-md-12 > div
pipocas.tv##+js(bab-defuser)
pl.premium4kflix.club###playerCta-wrapper
ppss.kr##+js(aost, Math.random, invoke)
qwant.com##div[data-monitoring="adsWebSerpOk"]
reddit.com###ad_1
reddit.com###ad_4
reddit.com###ad_5
reddit.com###ad_6
reddit.com##._3RPJ8hHnfFohktLZca18J6
reddit.com##.author-tooltip
reddit.com##.dfp-ad-container
reddit.com##.premium-banner
reddit.com##.s1tljykw-0
reddit.com##.ynts11-1
reddit.com##body > div[data-overflow]:last-child
reddit.com##shreddit-comment:has(>[vote-state="DOWN"])>:not(shreddit-comment)
resid3ncy.com###chated-overlay
rp-online.de##.park-article--reduced::after:style(content:none !important; background-image:none !important)
rp-online.de##.park-article-paywall__content
rp-online.de##p.text-blurred:style(color:initial !important; text-shadow:none !important)
scotthelme.co.uk##.support
sec.gov##div[style="break-before: page; margin-top: 6pt; margin-bottom: 6pt"], div[style="page-break-before: always; margin-top: 6pt; margin-bottom: 6pt"]:remove()
seriouseats.com##.ad-wrapper
seriouseats.com#@#.nav-share
simplywall.st##+js(aeld, scroll, setTimeout)
spiegel.de##^script:has-text(.createShadowRoot)
strikeout.cc##+js(nostif, userHasAdblocker)
strikeout.im##^script:has-text(JSON.parse)
strikeout.im##^script:has-text(ZpQw9XkLmN8c3vR3)
stupidfanboy.wordpress.com##.native-ad-marker:upward(article)
techdator.net##.td-container-wrap.td-banner-wrap-full
technicpack.net##+js(acis, document.createElement, admiral)
techpowerup.com##.mnmuzjsddc
techpowerup.com##.site-header__logo-wrapper + div > a[target="_blank"] img
techpowerup.com##^script:has-text(.mnnusjsdde)
techpowerup.com##^script:has-text(.mnnusjsddg)
techpowerup.com##^script:has-text(UA-5304621-1)
techpowerup.com##^script:has-text(adblock-tester)
thebroodle.com##.EAJKXIqksYmj-bg
thebroodle.com##.EAJKXIqksYmj-default
theforestmap.com##.in.fade.modal-backdrop
theforestmap.com##.sidefloater
thehackernews.com##.cf.follow-box
thehackernews.com##.sidebar.clear > [href="https://go.thn.li/webinar-2"]
thehackernews.com##.top-follow
thehackernews.com##[href="https://go.thn.li/mpu"]
thesolving.com##.nanoBackground
tikolu.net##+js(aopr, HTMLElement.prototype.oncontextmenu)
tiktok.com###login-modal,[class*="DivModalContainer"]
troypoint.com##.code-block
troypoint.com##.front-site.mysticky-welcomebar-fixed
tutsgalaxy.net##+js(nobab)
twitch.tv##div.side-nav-section a:has-text(/Pools, Hot Tubs, Beaches, Fitness & Health/i)
uploadship.com##+js(acis, document.getElementById, adblock)
wikipedia.org###vector-toc-pinned-container:style(position: static !important;)
winaero.com##.entry-content > div
windowscentral.com##div:nth-of-type(7)
wordpress.com##.lpc-vip-modal-backdrop
wordpress.com##.lpc-vip-modal-window-container
wordpress.com#@##gdpr-cookie-banner
worldpopulationreview.com##+js(abort-current-inline-script, document.createElement, admiral)
www.177milkstreet.com##.popup--enabled.popup--required.popup.newsletter-popup
www.49erswebzone.com###adblock_article_before
www.49erswebzone.com###top-spacer
www.49erswebzone.com##.adblock_300x250
www.49erswebzone.com##.backup-ad
www.49erswebzone.com##.mobile-hide.main-adblock.adblock_300x600
www.49erswebzone.com##.st_container
www.49erswebzone.com##div.adblock_container
www.49erswebzone.com##div.main-adblock.adblock_300xflex
www.amazon.com###desktop-banner
www.amazon.com###desktop-dp-ilm_feature_div_01
www.amazon.com###nav-rufus-disco
www.amazon.com##.nav-rufus-content
www.amazon.com##.rufus-panel-closed-to-peek.rufus-panel-container
www.bleepingcomputer.com##.bc_wrapper > .bc_main_content > .container > .row > .col-md-8 > .cz-main-left-section > .article_section > .articleBody > p > .cnx-main-container-flex.cnx-ps.cnx-in-desktop.cnx-main-container > .cnx-size-responsive.cnx-player-wrapper > .cnx-bp-xl-v.cnx-bp-lg-st.cnx-in-ps-landscape.cnx-playspace-container
www.bleepingcomputer.com##.bc_wrapper > .bc_main_content > .container > .row > .col-md-8 > .cz-main-left-section > .article_section > .articleBody > p > .cnx-main-container-flex.cnx-ps.cnx-in-desktop.cnx-main-container > .cnx-size-responsive.cnx-player-wrapper > .cnx-ratio
www.bleepingcomputer.com##.bc_wrapper > .bc_main_content > .container > .row > .col-md-8 > .cz-main-left-section > .article_section > .articleBody > p > .cnx-main-container-flex.cnx-ps.cnx-in-desktop.cnx-main-container > .cnx-size-responsive.cnx-player-wrapper > .cnx-ui-ps-image-background.cnx-ui-ps-image-wrapper
www.cbssports.com##.nav-network-bar
www.cbssports.com#@#.site-nav-inner
www.charliekirk.com##.dmaeFh.sc-4a5db2d-0
www.eurogamer.net##.ot-sdk-container
www.fanatical.com##.cookie-collapsible
www.fark.com###abPleaBar
www.fastcompany.com##.box-195736
www.fastcompany.com##.preloaded_lightbox
www.fieldgulls.com##.tab-bar-fixed.c-tab-bar
www.forbes.com##.page-loaded
www.fosshub.com##.ad-alt > form
www.foxbusiness.com##.is-programming.alert-banner
www.foxnews.com##.commenting-nation-promo
www.foxnews.com##.four-items.topic-bucket
www.foxnews.com##.hedgehog-container
www.foxnews.com##.is-breaking-email.alert-banner
www.foxnews.com##.is-breaking.alert-banner
www.foxnews.com##.item-nation-trial-mod.item
www.foxnews.com##.promo-htu-ad-desktop.promo-htu-ad.promo
www.foxnews.com##.recommended-videos
www.foxnews.com##.related-topics
www.foxnews.com##.snack-bar
www.foxnews.com##div.inline.image-ct
www.foxnews.com#@#.promo
www.foxnews.com#@#video, audio:remove-attr(/disable(?:PictureInPicture|RemotePlayback)/i)
www.ghacks.net###ghacks_latest_from_softonic-2
www.ghacks.net##.category-deals,important
www.ghacks.net##.category-sponsored
www.ghacks.net##.hentry.status-publish.type-page.page.post-211374.mt--first--0.mt--60.post-list
www.ghacks.net##.hot.intro-articles-section
www.ghacks.net##.slick-arrow.slick-next
www.ghacks.net##.slick-arrow.slick-prev
www.ghacks.net##.tag-featured
www.ghacks.net##[id^="ghacks_ad_code-"]
www.ghacks.net##body > main > section.intro-articles-section > div.large-container > div.home-intro.home-latest-artitles > div.home-intro-hold-posts > div.home-posts.spansored-item
www.ghacks.net##div.post-subtitle-meta:nth-of-type(1)
www.google.*##.g:has(a[href*="reddit.com"][href*="tl="])
www.google.*##[role="navigation"] [role="list"]>[role="listitem"]:has([href^="/search"][href*="&udm=50"])
www.google.*##a[href*="agoda.com"]:upward(.g)
www.google.com###lb
www.google.com##.L3eUgb > .om7nvf.ikrT4e.o3j99 > form > div > .emcav.A8SBwf > .UUbT9 > .aajZCb
www.independent.co.uk##.video-sticky-video
www.indystar.com##.gnt_pm
www.kootenaivalleytimes.com#@#.section-social
www.latimes.com###\38 cd4c321-9fd2-4261-b708-33ff456f0217
www.latimes.com###rule-2999
www.latimes.com###rule-3000
www.latimes.com##.met-rule-2772.met-flyout
www.latimes.com##.met-rule-3004.met-flyout > .met-button-varB
www.latimes.com##.met-rule-3007.met-flyout
www.latimes.com##.ncm-container
www.latimes.com##.overlay
www.latimes.com##.wrapclicker
www.mediafire.com###abnotify
www.mercurynews.com##.videoPlayer.smartMatch.hasStarted.float
www.microcenter.com###ads
www.msn.com###irisbanner > .irisbannertop.irisbanner
www.msn.com##.loaded.allowvig.articlecontent > .shadow
www.msn.com##.scrolled.head
www.nascar.com###lightbox-iframe-5d70b5c6-2942-4be9-945d-90d19567df7f
www.nascar.com##div#ad_bnr_atf_01.nascar-advertisement.ad_bnr_atf_01
www.nascar.com##div#ad_impression_tracker_01
www.nascar.com##div#ad_impression_tracker_02
www.nascar.com##div#ad_impression_tracker_03
www.nascar.com##div#ad_impression_tracker_04
www.nascar.com##div#ad_oop_skin_01.globalSkinAdSlot
www.nascar.com##div#consent_blackbar
www.nascar.com##div#content.site-content > div.entry-content.panel-row-style > div.ad-close-container
www.nascar.com##div#content.site-content > div.entry-content.panel-row-style > div.nascar-ad-container
www.nascar.com##footer#footer.site-footer.site-footer-nascar > div.nascar-footer > footer > div.row.divider > div.col-3 > div.disclaimer-container
www.newegg.com##.floating-live
www.ninersnation.com##.adblock-allowlist-messaging__wrapper
www.ninersnation.com##.tab-bar-fixed.c-tab-bar
www.ninersnation.com##div.c-compact-river__entry:nth-of-type(10)
www.okdo.com##.c-notification-bar
www.ownedcore.com##.b-below-so-wrapper
www.ownedcore.com##.s2nFrameHost
www.ownedcore.com##[href^="https://www.ownedcore.com/forums/cb.php"]
www.ownedcore.com##[src="https://www.ownedcore.com/forums/./ocpbanners/1/3/9/6/9/4/8/33b0c70aaf89c4d9fdfc94f2bf6259a5.png"]
www.phoronix.com###\31 ca940
www.publish0x.com##.modal-content
www.reddit.com##.happening-now
www.reddit.com##.redesignbetabar-js.redesignNightmodeBar.onboardingbar.infobar
www.reddit.com##.res-selected.RES-keyNav-activeElement.unvoted.entry > .tagline > .flair-kaphead.flair
www.reddit.com##.stickied:has-text(/AutoModerator/)
www.rockpapershotgun.com###onetrust-button-group-parent
www.rockpapershotgun.com###onetrust-group-container
www.rockpapershotgun.com##.ot-fade-in.onetrust-pc-dark-filter
www.sejda.com##.bottom-fixed.step3a.centered
www.spanishdict.com###adSide2-container
www.techpowerup.com##.nkuzlfvdywj
www.theatlantic.com##.c-nudge-compressed__container.c-nudge__container
www.theepochtimes.com##.related-articles.shortcode
www.theglobeandmail.com###fixedpencil-subs
www.thekitchenmagpie.com###text-125 > .widget-wrap > .textwidget > .food-bank-note
www.thekitchenmagpie.com###wprm-recipe-container-36576 > .food-bank-note
www.theregister.com###adtoniq-msgr-bar
www.thewindowsclub.com###page > .main > .container > .row > .col-xs-12 > .row > .col-xs-12.col-sm-12.col-md-8 > .y-link-underline > .entry-affiliate > strong > [href^="http://www.restoro.com/includes/route.php"]
www.thewindowsclub.com###page > .main > .container > .row > .col-xs-12 > .row > .col-xs-12.col-sm-12.col-md-8 > .y-link-underline > .entry-content > div.c24ff8f4a2da697123def04f69833d8b > span > strong > [href^="http://www.restoro.com/includes/route.php"]
www.thewindowsclub.com###page > .main > .container > .row > .col-xs-12.col-sm-12.col-md-4 > .sidebar > .widget_text.group.widget
www.tomshardware.com###affiliateDisclaimer
www.twitch.tv##.cwtKyw:has-text(/Djs/i)
www.twitch.tv##.front-page-carousel,important
www.twitch.tv##.gEvECC.Layout-sc-1xcs6mc-0
www.twitch.tv##.ghbJdj:has-text(/roblox/i)
www.twitch.tv##.tw-balloon.dduVcl.InjectLayout-sc-1i43xsx-0.kyIBpI.ScBalloonWrapper-sc-14jr088-0
www.ukr.net##.right-side__block
www.windowscentral.com##.article-header__disclosure
www.windowscentral.com##.border-neutral-300.border-y.border-solid.mb-4.pb-4.pt-3.clear-both
www.yahoo.com###convenience-bar
www.yahoo.com##.md\:shadow-\[0_0_10px_0_rgba\(0\,0\,0\,0\.4\)\].md\:h-12.md\:top-16.bg-primary.shadow-\[0_4px_8px_0_rgba\(0\,0\,0\,0\.1\)\,0_0_1px_0_rgba\(0\,0\,0\,0\.1\)\].w-full.h-10.z-11.left-0.fixed
www.youtube.com###actions.ytd-watch-metadata [aria-label="Ask"]
www.youtube.com###teaser-carousel,  important
www.youtube.com###ytd-player, #thumbnail, .ytp-preview, .ytp-tooltip-bg, yt-thumbnail-view-model:style( border-radius: 0px !important; )
www.youtube.com##+js(nano-stb, resolve(1), *, 0.001)
www.youtube.com##+js(set, yt.config_.EXPERIMENT_FLAGS.ab_pl_man, false)
www.youtube.com##+js(set, yt.config_.EXPERIMENT_FLAGS.web_enable_ab_rsp_cl, false)
www.youtube.com##:is(head, yt-thumbnail-hover-overlay-toggle-actions-view-model)
www.youtube.com##[has-video-summary]
www.youtube.com##div[skip-key-interaction]
www.youtube.com##ytd-browse[page-subtype="home"] ytd-rich-item-renderer:has(#video-title-link[aria-label~="views"]:not(:is([aria-label*=",0"],[aria-label*=",1"],[aria-label*=",2"],[aria-label*=",3"],[aria-label*=",4"],[aria-label*=",5"],[aria-label*=",6"],[aria-label*=",7"],[aria-label*=",8"],[aria-label*=",9"])))
wzstats.gg##app-350x100-dynamic-ad
wzstats.gg##app-desktop-takeover-ad
x.com###layers:has([src^="https://ton.twitter.com/twitter_blue_for_business/verified-programs/discount_upsell"]) 
x.com##.r-12vffkv.r-1p0dtai.r-1xcajam.r-1d2f490.r-zchlnj.r-aqfbo4.css-175oi2r > div.r-12vffkv.css-175oi2r > .r-12vffkv.css-175oi2r
x.com##[aria-label^="Edit image"]
youtube.com##*:style(scrollbar-color: initial !important; scrollbar-width: initial !important;)
youtube.com##+js(set, yt.config_.EXPERIMENT_FLAGS.kevlar_watch_max_player_width, 1280)
youtube.com##.ytThumbnailOverlayProgressBarHostWatchedProgressBarSegment:style(background: #FF0000 !important)
youtube.com##.ytp-cairo-refresh-signature-moments .ytp-play-progress:style(background: #FF0000 !important;)
youtube.com##.ytp-play-progress:style(background: #FF0000 !important;)
youtube.com##html, body:style(--yt-spec-static-brand-red: #FF0000 !important; --yt-spec-static-overlay-background-brand: rgba(255, 0, 0, 0.9) !important;)
youtube.com##ytd-rich-grid-renderer, html:style(--ytd-rich-grid-items-per-row: 5 !important;)
youtube.com##ytd-rich-grid-renderer, html:style(--ytd-rich-grid-posts-per-row: 5 !important;)
youtube.com##ytd-rich-grid-row, #contents.ytd-rich-grid-row:style(display:contents !important;)
youtube.com##ytd-rich-section-renderer
youtube.com##ytd-thumbnail-overlay-resume-playback-renderer #progress.ytd-thumbnail-overlay-resume-playback-renderer:style(background: #FF0000 !important;)
yts.mx##div.hidden-sm.hidden-xs > .cbas-brdrd
||2822.v.fwmrm.net^
||9b.news/ads$image
||9b.news/wp-content/uploads/247f6ba028.js?ver=14.12.6$script,1p,important
||accountkit.*/
||ads.adaptv.advertising.com^
||advertisermirror.com^
||alb.reddit.com^$all
||analytics-api.samsunghealthcn.com^
||analytics.gandi.net^
||analytics.pointdrive.linkedin.com^
||api.chated.io/sdk/v1/popups/*$subdocument
||appmetrica.yandex.com^
||atwola.com^
||banananalytics.com^$important
||betanews.com/wp-content/themes/betanews/images/carousel-image-960x250-win-10-PRO.png$image
||betanews.com/wp-content/themes/betanews/images/curved_header.png$image
||bilsyndication.com^
||bizpanda.com
||boilingcredit.com^
||brightcove.com^$domain=yahoo.com
||c.thumbs.redditmedia.com/UNcO-h_QcS9PD-Gn.jpg$image
||carvecakes.com^
||cdn.adsafeprotected.com^
||cdn.concert.io/lib/adblock/*
||cdn.report-uri.com^
||cdn.shopifycloud.com/messenger_commerce/assets/custom-button/*.png$image
||cdn.yottos.com^
||clksite.com^$important
||content.jwplatform.com^$domain=variety.com
||coronavirus.idaho.gov/wp-content/uploads/2021/08/Button_CoronavirusWebsite-*.png$image
||curtistimes.com^
||d17xmf66fp9kg9.cloudfront.net/o?fqdn=https://www.wsj.com/*$xhr,domain=www.wsj.com
||data.mistat.xiaomi.com^
||dev-nano.com^$all
||digitalasset.intuit.com/IMAGE/A9xZVPnTr/Default_MAX_Refund_Dynamic_Ad_270x600_V2.jpg$image
||digitru.st^
||disqus.com/api/3.0/threadReactions/
||disqus.com/count.js$script
||disqus.com/embed.js$script,redirect=disqus_embed.js
||disqus.com/forums/*/embed.js$script,redirect=disqus_forums_embed.js
||disqusads.com^$important
||dockdigestion.com^
||doubleclick.net^$important,domain=~soranews24.com
||epsolution-mbst-pub-uw2.s3.us-west-2.amazonaws.com/cx/blendr/v2/image-ff-2020-on-net-commish-1000-x-1000-1-x-jpg_1597649548457.jpeg$image
||epsolution-mbst-pub-uw2.s3.us-west-2.amazonaws.com/cx/blendr/v2/image-ff-2020-on-net-players-1000-x-1000-1-x-1-jpg_1598203769597.jpeg$image
||epsolution-mbst-pub-uw2.s3.us-west-2.amazonaws.com/cx/blendr/v2/image-read-react-header-new-logo-1000-px-1-png_1571097571506.png$image
||epsolution-mbst-pub-uw2.s3.us-west-2.amazonaws.com/cx/blendr/v2/image-yc-fl-off-net-school-start-league-ji-070919-v-1-3-light-800-x-800-x-1-jpg_1566418730380.jpeg$image
||exactmetrics.com
||extmaps-api.yandex.net^
||flintos.io/wp-content/plugins/popup-builder/*
||floweryfact.com^$xhr,domain=www.howtogeek.com,important
||forum.opnsense.org/adds/content/8.applianceshop_20160413.jpg$image
||forum.opnsense.org/adds/content/x*_20160413.jpg.pagespeed.ic.*.webp$image
||ghacks.net/statics/ads.min.js
||ghacks.net/statics/px.gif
||google.*$removeparam=gws_rd=ssl
||googleanalytics.net^
||googlevideo.com/videoplayback$xhr,3p,method=get,domain=www.youtube.com
||hd-dev.com^
||https://platform.linkedin.com/in,important
||i2.wp.com/freetimetech.com/wp-content/uploads/2020/10/BOTTOMADBANNER.png?*&ssl=1$image
||ima3vpaid.appspot.com^
||img.huffingtonpost.com/asset/5c8ee47f23000033006bf982.jpeg
||img.picturegalaxy.org/data/statics/gen4ever.gif$image
||img.picturegalaxy.org/data/statics/gennew.gif^
||ip-reachability.isp.netscape.com/pixel.gif$image
||jamexistence.com^$important
||js.hs-banner.com/53.js$important
||logbak.hicloud.com^
||logservice.hicloud.com^
||logservice1.hicloud.com^
||mailtrack.io^$important
||metrics.icloud.com^
||mobilenations.com^
||mssl.fwmrm.net/p/nbcu_rsn_live/AdManager.js$document,important
||nc0.co^$important
||notix.io
||oath.com^all
||p-n.io
||phys.org^important
||pixel.quantserve.com/pixel^
||pocketfaucet.com^
||polyfill.io^
||pushly.com
||pushlycdn.com
||rawgit.com^$important
||reddit.com^$removeparam=tl
||report-uri.cloudflare.com^
||s3.buysellads.com^
||scotthelme.report-uri.com^$all
||sdk.privacy-center.org/*/loader.js
||servebom.com^
||serving-sys.com^
||simplywall.st/backend/flags/proxy/client/metrics$1p
||src.ebay-us.com^*/check.js
||st.chatango.com/h5/gz/r0402211818/id.html$subdocument
||st.chatango.com/h5/gz/r0409211505/id.html$subdocument
||st.chatango.com/h5/gz/r0817211056/id.html$subdocument
||static-42andpark-com.s3.amazonaws.com^
||stripe.rs-stripe.com
||subscribe.washingtonpost.com^
||supportmetrics.apple.com^
||syncronex.com^
||taboola.com^
||tfbnw.*/
||thehackernews.com/images/-bCcBfZ1l2S0/Xq2HbDKTajI/AAAAAAAA2uI/MlJiZjsDHuwqqQuDT4xKygGqI9wtXBdRQCLcBGAsYHQ/s300-e100/sidebar-webinar-2.jpg$image
||tinypass.com^$3p
||tpucdn.com/images/*75willrunoutofdirssoon*/$image
||trk.pinterest.com^
||troypoint.com/wp-content/uploads/2020/01/Troypoint-IPV-970X250-protect.png$image
||tstats-13fkh44r.com:4413/track-visit$xhr,domain=torrentgalaxy.to,important
||upst.fwdcdn.com/temp/blocks/*$image
||vbt.io^
||verizonmedia.com^
||volantix.com^
||whatsapp.*/
||windows.net^
||wp.pl^$third-party,domain=~wp.pl
||wpimg.pl^$third-party,domain=~wp.pl
||www.49erswebzone.com/anyclip.html$subdocument
||www.bing.com/rewardsapp/flyout$subdocument
||www.builtbygirls.com^
||www.ghacks.net/statics/dfp.js
||www.microsoft.com-windows-booster.live^
||www.palemoon.org/images/donate_vertbanner.png$image
||www.sysnettechsolutions.com/wp-content/themes/schema-lite/Best-Selling-Routers.png$image
||www.techpowerup.com/njutrvceser/*.jpg$image
||www.techpowerup.com/review/*75345380048075*/images/$image
||www.techpowerup.com/thlknzrjbv^
||yo/guce-js
||yonxatuor.com
||ysearchblog.com^
||zenfs.com^
||zupimages.net/up/19/42/6umy.gif$image
